VerwijsIndexService/StatusPage.html

<!DOCTYPE html>
<html>
<head>
    <meta http-equiv="cache-control" content="max-age=0" />
    <meta http-equiv="cache-control" content="no-cache" />
    <meta http-equiv="expires" content="0" />
    <meta http-equiv="expires" content="Tue, 01 Jan 1980 1:00:00 GMT" />
    <meta http-equiv="pragma" content="no-cache" />
</head>
<body>
    <table>
        <tr>
            <th>Service</th>
            <th>GET</th>
            <th>POST</th>
        </tr>
        <tr>
            <td>VerwijsIndexService</td>
            <td id="vwx">unknown</td>
            <td id="vwxPost"></td>
        </tr>
        <tr>
            <td>ProviderService</td>
            <td id="ps">unknown</td>
            <td id="psPost"></td>
        </tr>
        <tr>
            <td>Registration</td>
            <td id="npr">unknown</td>
            <td id="nprPost"></td>
        </tr>
    </table>
    <!--<button onclick="testPOST('https://verwijsindex.azurewebsites.net/Service/registration.svc', 'vwxPost')">TestPOST</button>-->
    <script>
        function test(svc, tgt) {
            var req = new XMLHttpRequest();
            req.onreadystatechange = function () {
                if (req.readyState == 4)
                    document.getElementById(tgt).innerText = req.statusText;
            }
            req.open("GET", svc, true);
            req.send();
        }

		 function testPOST(svc, tgt) {
            var req = new XMLHttpRequest();
            req.onreadystatechange = function () {
                if (req.readyState == 4)
                    document.getElementById(tgt).innerText = req.statusText;
            }
			req.open("POST", svc, true);

			req.setRequestHeader("Content-Type", "text/xml");

			var payload = '<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://rdw.nl/rpv/1.0/IRegistration/StatusRequest</a:Action><a:MessageID>string</a:MessageID><a:To s:mustUnderstand="1">https://verwijsindex.azurewebsites.net/Service/registration.svc</a:To></s:Header><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><StatusRequestRequest xmlns="http://rdw.nl/rpv/1.0"><StatusRequestRequestData><StatusReference>strin2g</StatusReference></StatusRequestRequestData></StatusRequestRequest></s:Body></s:Envelope>';

            req.send(payload);
        }

		function testPOST2(svc, tgt) {
            var req = new XMLHttpRequest();
            req.onreadystatechange = function () {
                if (req.readyState == 4)
                    document.getElementById(tgt).innerText = req.statusText;
            }
			req.open("POST", svc, true);

			req.setRequestHeader("Content-Type", "application/soap+xml");

			var payload = '<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">https://verwijsindex.shpv.nl/service/VerwijsIndex/ServiceStatus</a:Action><a:MessageID>string</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">'+svc+'</a:To></s:Header><s:Body><ServiceStatus xmlns="https://verwijsindex.shpv.nl/service/" /></s:Body></s:Envelope>';

            req.send(payload);
        }

		function testPOST3(svc, tgt) {
            var req = new XMLHttpRequest();
            req.onreadystatechange = function () {
                if (req.readyState == 4)
                    document.getElementById(tgt).innerText = req.statusText;
            }
			req.open("POST", svc, true);

			req.setRequestHeader("Content-Type", "application/soap+xml");

			var payload = '<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://www.w3.org/2003/05/soap-envelope"><s:Header><a:Action s:mustUnderstand="1">https://verwijsindex.shpv.nl/service/Provider/ServiceStatus</a:Action><a:MessageID>string</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">'+svc+'</a:To></s:Header><s:Body><ServiceStatus xmlns="https://verwijsindex.shpv.nl/service/" /></s:Body></s:Envelope>';

            req.send(payload);
        }

        window.onload = function () {
            testPOST('https://verwijsindex.azurewebsites.net/Service/registration.svc', 'nprPost');
			testPOST3('https://verwijsindex.azurewebsites.net/Service/ProviderService.svc', 'psPost');
			testPOST2('https://verwijsindex.azurewebsites.net/Service/VerwijsIndexService.svc', 'vwxPost');

			test('https://verwijsindex.azurewebsites.net/Service/registration.svc', 'vwx');
            test('https://verwijsindex.azurewebsites.net/Service/ProviderService.svc', 'ps');
            test('https://verwijsindex.azurewebsites.net/Service/Registration.svc', 'npr');

        }
    </script>
</body>
</html>